#+TITLE:  Showing Off YesQL
#+AUTHOR: Howard Abrams
#+EMAIL:  howard.abrams@gmail.com
#+DATE:   2015 Feb 26
#+TAGS:   clojure presentation technical

* Database Schema
  :PROPERTIES:
  :engine:   mysql
  :dbhost:   172.16.0.10
  :dbuser:   howard
  :database: bx
  :END:

  Let’s investigate the schema:

  #+BEGIN_SRC sql
  show tables;
  #+END_SRC

  #+RESULTS:
  | Tables_in_bx    |
  |-----------------|
  | BX-Book-Ratings |
  | BX-Books        |
  | BX-Users        |

  #+BEGIN_SRC sql
  SHOW columns FROM `BX-Users`;
  #+END_SRC

  #+RESULTS:
  | Field    | Type         | Null | Key | Default | Extra |
  |----------+--------------+------+-----+---------+-------|
  | User-ID  | int(11)      | NO   | PRI | 0       |       |
  | Location | varchar(250) | YES  |     | NULL    |       |
  | Age      | int(11)      | YES  |     | NULL    |       |

  #+BEGIN_SRC sql
  SHOW columns FROM `BX-Books`;
  #+END_SRC

  #+RESULTS:
  | Field               | Type             | Null | Key | Default | Extra |
  |---------------------+------------------+------+-----+---------+-------|
  | ISBN                | varchar(13)      | NO   | PRI |         |       |
  | Book-Title          | varchar(255)     | YES  |     | NULL    |       |
  | Book-Author         | varchar(255)     | YES  |     | NULL    |       |
  | Year-Of-Publication | int(10) unsigned | YES  |     | NULL    |       |
  | Publisher           | varchar(255)     | YES  |     | NULL    |       |
  | Image-URL-S         | varchar(255)     | YES  |     | NULL    |       |
  | Image-URL-M         | varchar(255)     | YES  |     | NULL    |       |
  | Image-URL-L         | varchar(255)     | YES  |     | NULL    |       |

  #+BEGIN_SRC sql
  SHOW columns FROM `BX-Book-Ratings`;
  #+END_SRC

  #+RESULTS:
  | Field       | Type        | Null | Key | Default | Extra |
  |-------------+-------------+------+-----+---------+-------|
  | User-ID     | int(11)     | NO   | PRI |       0 |       |
  | ISBN        | varchar(13) | NO   | PRI |         |       |
  | Book-Rating | int(11)     | NO   |     |       0 |       |
